{
  "post_id": 9471,
  "title": "Using a metrics alias for 1 metric with multiple names",
  "slug": "metrics-alias",
  "url": "https://datatoolspro.com/tutorials/metrics-alias/",
  "date": "2024-04-28T13:15:33",
  "modified": "2024-04-28T13:19:40",
  "categories": [
    "DataTools Pro"
  ],
  "tags": [
    "alias",
    "metrics"
  ],
  "excerpt": "This tutorial covers using a metrics alias where you may have 1 unique metric or KPI that has an abbreviation or multiple names.",
  "content_markdown": "This tutorial covers using a metrics alias where you may have 1 unique metric or KPI that has an abbreviation or multiple names. A highly common scenario in any enterprise is having multiple names or terms for a single metric or KPI. There are plenty of reasonable cases where this could occur. [DataTools Pro metrics glossary](https://datatoolspro.com/salesforce-metrics-glossary/ \"Metrics Glossary\") covers this using aliases.\n\n**Common reasons why you could have multiple names for 1 metric:**\n\n- Abbreviations or short names that business or technology professionals use.\n- Evolution of an enterprises taxonomies and definitions\n- Mergers and acquisitions\n- Consolidation of teams and new leadership\n- Refinement in performance management practice\n\n[DataTools Pro](https://datatoolspro.com/datatools-for-salesforce \"https://datatoolspro.com\") provides metric aliases, so you can define and change the definitive name of your metrics over time while retaining all of the aliases.\n\n![](https://datatoolspro.com/wp-content/uploads/2024/04/image-2.png)\n\n## How does DataTools Pro use aliases?\n\n### Reference tool\n\nAs a reference tool, DataTools Pro users have constant visibility over aliases within the metrics table or within the metrics details side panel.\n\n### Change management tracking\n\nWith DataTools Pro metric chnage tracking, we allow you to retain the history as your metrics and KPIs evolve\n\n### AI enhanced metric Analyst\n\nWhen you use DataTools Pro Metric Analyst we utilize all metrics aliases to compare and interpret when metrics are brand new or simply new variations of metrics you already track.\n\n## Adding or Editing DataTools Pro Aliases\n\n### **Add or Edit Alias from the Metrics table**:\n\n1. Click the “+” button from the Aliases column OR click on the name of an Alias\n\n![](https://datatoolspro.com/wp-content/uploads/2024/04/image-3-1024x292.png)\n\n2. Enter your Alias name and click “Add”\n\n![](https://datatoolspro.com/wp-content/uploads/2024/04/image-5.png)\n\n3. You can modify your Alias as primary which impacts how your metric will appear in DataTools Pro.\n\n![](https://datatoolspro.com/wp-content/uploads/2024/04/image-6.png)\n\n### **Add or Edit Alias from the Metrics Side Panel**:\n\nYou can complete the same steps prior by clicking the “Edit” button to the left of the title “Metrics Name and Aliases”\n\n![](https://datatoolspro.com/wp-content/uploads/2024/04/image-4.png)\n\n## Updating Primary Metrics Alias\n\nThe “Primary” alias is what DataTools Pro uses to visually represent the name of your metric throughout the user experience, with the notion that the primary represents what is most commonly accepted for your orginazation.\n\n## Tracking Metrics Alias Changes\n\nWhen metrics aliases change, you can view those changes in the metrics audit logs.\n\n1. Click on the history icon located on the metrics page above the metrics table.\n\n![](https://datatoolspro.com/wp-content/uploads/2024/04/image-8.png)\n\n2. Select “Alias” within the Filter by Action dropdown.\n\n![](https://datatoolspro.com/wp-content/uploads/2024/04/image-7-1024x408.png)"
}