{
  "post_id": 10840,
  "title": "Create a GitHub personal access token for Snowflake and DataTools Pro",
  "slug": "github-personal-access-token",
  "url": "https://datatoolspro.com/tutorials/github-personal-access-token/",
  "date": "2024-12-22T20:29:17",
  "modified": "2025-01-08T00:33:32",
  "categories": [
    "DataTools Pro"
  ],
  "tags": [
    "datatoolspro",
    "GitHub"
  ],
  "excerpt": "To integrate GitHub source control with Snowflake or even DataTools Pro, you can create GitHub personal access token, which grants fine grained control. You can click here to go directly to the “Generate new token page” or follow 5 steps below:https://github.com/settings/personal-access-tokens/new 1. Login to your GitHub 2. Access Settings: Log in to your GitHub account. […]",
  "content_markdown": "To integrate GitHub source control with Snowflake or even [DataTools Pro](/datatools-for-salesforce \"DataTools Pro for Salesforce\"), you can create GitHub personal access token, which grants fine grained control.\n\nYou can click here to go directly to the “Generate new token page” or follow 5 steps below:\n<https://github.com/settings/personal-access-tokens/new>\n\n1. [Login to your GitHub](https://github.com/login \"Sign in to GitHub\")\n\n**2. Access Settings:** Log in to your GitHub account. Click on your profile picture in the top-right corner and select “Settings.”\n\n**3.** **Navigate to Developer Settings:** In the left sidebar, click on “Developer settings.”\n\n**4.** **Personal Access Tokens:** Under “Personal access tokens,” select “Fine-grained tokens.”\n\n**5. Generate New Token:** Click on “Generate new token.”\n\nThere are a lot of options to configure fine grained access for your token, which is very helpful to narrow the scope of use for use with Snowflake or DataTools Pro.\n\n## **Configure your GitHub personal access token:**\n\n- **Token Name:** Provide a descriptive name for the token.\n- **Expiration:** Set an expiration date to enhance security. Typically we select a 90 day window and rotate keys as part of maintenance. Because this is a read-only token. The option to implement a non-expiring token exists but we do not recommend using it.\n- **Resource Owner:** Choose the appropriate resource owner (your account or an organization).\n- **Repository Access:** Select “Only select repositories.”\n  - Specify the repositories the token can access. You can start with a single repository and always come back to add more later. Do not grant access to “All repositories”\n- **Repository Access:** Selected repositories → Choose only the repository you need.\n- **Permissions:** Permissions can be daunting because there are so many options. Here are the necessary permissions for use with Snowflake. This is to ensure you have designed your token for minimal access:\n  - **Required:** Metadata, Contents.\n  - **Optional:** Actions (if relevant to your setup).\n\nThis setup ensures your token is secure and adheres to the principle of least privilege, giving Snowflake only the access it needs to function properly with your GitHub repository. Let me know if you need further clarification!\n\n**Generate Token:** After configuring the settings, click “Generate token.” Ensure you copy and store the token securely, as it will not be displayed again.\n\n[Learn more about personal access tokens from GitHub documentation](https://docs.github.com/en/authentication/keeping-your-account-and-data-secure/managing-your-personal-access-tokens?utm_source=chatgpt.com)\n\n### Save your Token\n\nStore your token in a safe location, specifically a key vault like Azure key vault or password management app like 1Password.\n\n![GitHub Personal Access Token](https://datatoolspro.com/wp-content/uploads/2024/11/image-57-png.webp)\n\n## Adding Write Permission for DataTools Pro Commits\n\nTo save from DataTools Pro into GitHub, add Read and Write permission to Contents\n\n![](https://datatoolspro.com/wp-content/uploads/2024/12/image-58-1024x105.webp)"
}