{
  "post_id": 8886,
  "title": "DataTools Pro Manage Account and Users",
  "slug": "manage-datatools-pro-account-and-users",
  "url": "https://datatoolspro.com/tutorials/manage-datatools-pro-account-and-users/",
  "date": "2023-11-10T00:58:42",
  "modified": "2024-06-22T22:56:13",
  "categories": [
    "DataTools Pro"
  ],
  "tags": [
    "Administration",
    "datatoolspro",
    "user management"
  ],
  "excerpt": "DataTools Pro provides standard roles and fine grained permissions to manage account and Users",
  "content_markdown": "[DataTools Pro](https://datatoolspro.com/datatools-for-salesforce/ \"DataTools Pro\") provides standard roles and fine grained permissions to access manage account and users. The Manage users feature allows account owners and admins to inviting users, and set permissions.\n\n- [My Account Section:](#aioseo-my-account-section)\n  - [Understanding DataTools Pro Accounts](#aioseo-understanding-datatools-pro-accounts)\n- [Adding Users](#aioseo-adding-users)\n- [Managing Users](#aioseo-managing-users)\n- [Standard Roles](#aioseo-standard-roles)\n  - [Admin](#aioseo-admin)\n  - [Editor](#aioseo-editor)\n  - [Read Only](#aioseo-read-only)\n- [Inviting a New User](#aioseo-inviting-a-new-user)\n  - [3. Joining DataTools Pro as an Invited User](#aioseo-3-joining-datatools-pro-as-an-invited-user)\n  - [4. Inviting More Members](#aioseo-4-inviting-more-members)\n- [Permissions](#aioseo-permissions)\n  - [Need Help?](#aioseo-need-help)\n\n## My Account Section:\n\n- Account Name: Update your account from “My Account” to a name, likely your company, or instance of Salesforce. To change the account name, click on the edit icon (indicated by a pencil icon).\n- NOTE: When you change the account name, we leave the dropdown toolbar to “My Account” to clearly identify the account that you manage.\n\n![](https://datatoolspro.com/wp-content/uploads/2024/01/image-17.png)\n\n### **Understanding DataTools Pro Accounts**\n\nWhen you login to your Salesforce organization instance and connect DataTools Pro as a [Salesforce connected app](https://help.salesforce.com/s/articleView?id=connected_app_overview.htm&language=en_US \"Salesforce Connected App\"), it automatically generates a DataToolsPro account. It is possible for multiple users in your Salesforce organization to have created their own account.\n\nTo share access to DataTools Pro, we require invite and granting access from a DataTools Pro administrator user. That requires all DataTools Pro users to have their own registered Salesforce users in the current security model.\n\n## Adding Users\n\nBy default DataTools Pro is free to access for individual contributor users. To add more users to your account, you can click to add more users through our online licensing option, powered by Stripe.\n\n## Managing Users\n\n![](https://datatoolspro.com/wp-content/uploads/2024/01/image-16-1024x452.png)\n\n## Standard Roles\n\nEach role has permissions to access and use DataTools Pro.\n\n### Admin\n\nFull access to manage all functions of your DataTools Pro org including inviting and managing users.\n\n### Editor\n\nAccess to add and edit records, but by default restricts deletion\n\n### Read Only\n\nRead-only access to DataTools Pro.\n\n## Inviting a New User\n\n1. **Sending the Invitation:**\n\nAs an admin, you can invite new members to join DataTools Pro directly from your account. Just enter their email, and they’ll get an invite straight to their inbox in the form of a one time use link. It is important that an invited user connect to the same organization that you have connected. Otherwise a user will be declined from accessing your DataTools Pro account.\n\n- **Email Address**: A field to input the email address of the customer to invite.\n- **Production vs Sandbox**: As part of the user invite process, it is important to specify if they are being invited to access a DataToolsPro app instance that is connected to your Salesforce prod or Sandbox Environment. This will guide invited users to the right environment.\n\nAs a standard measure we currently do not list any details about your Salesforce sandbox or production org within invite emails. We are always open to feedback how to improve our invite and onboarding for customers with complex, multi-environment configurations.\n\n#### **3. Joining DataTools Pro as an Invited User**\n\n1. **Click on the Invite Link:**\n   As an invitee to join the DataTools Pro account for your salesforce org, the invited user will get a one time use link to confirm the invite.\n2. **Enter Your Passcode:**\n   ***NOTE:*** During DataTools Pro beta, you can provide your passcode, or our admin team can assign a passcode. We are in the process of removing the passcode requirement as we move from private to public beta.\n3. **Log in Securely:**\n   Once you’re set up, log in with your new credentials. Our system is built with security in mind, so your data is always protected.\n\n#### 4. **Inviting More Members**\n\n- Need to invite more team members? Feel free to reach out to our team to get more invite credits to add more users to your DataTools Pro account.\n\n## Permissions\n\nNOTE: We are in the process of refining our permission naming and labeling and role based security. Some of these permissions are likely to change as we advance in our beta toward version 1. For example, “Scorecard” is our Dictionary object.\n\n1. Set All Permission: An option that, if checked, will select all permissions below.\n2. List Metric: Allows the customer to view metrics.\n3. Create Metric: Grants permission to create new metrics.\n4. Edit Metric: Allows editing of existing metrics.\n5. Delete Metric: Grants permission to delete metrics.\n6. Create Scorecard: Enables the creation of scorecards for performance or data tracking.\n7. List Scorecard: Allows viewing of existing scorecards.\n8. Edit Scorecard: Permits editing of scorecards.\n9. Delete Scorecard: Allows deletion of scorecards.\n10. Allow Score Card Mapping: Allows for mapping\n\n#### **Need Help?**\n\n- If you ever hit a bump, whether it’s during the invite process or your daily use of the app, our help resources are there to get you back on track.\n\nWelcome aboard, and enjoy using DataTools Pro!"
}