{
  "post_id": 11968,
  "title": "Security Policy – Salesforce Connected App",
  "slug": "security-policy-salesforce-connected-app",
  "url": "https://datatoolspro.com/tutorials/security-policy-salesforce-connected-app/",
  "date": "2025-10-11T00:09:29",
  "modified": "2025-10-11T00:09:44",
  "categories": [
    "DataTools Pro"
  ],
  "tags": [],
  "excerpt": "This page explains how DataTools Pro protects your data and keeps our Salesforce AppExchange solutions secure and available. Last updated: 2025-10-10 Our Commitment What We Operate Security by Design (SSDLC) Data Protection Tenancy Model We operate a shared-schema, logically isolated architecture. All data access is scope-limited by a required per-tenant identifier enforced through database row-level […]",
  "content_markdown": "This page explains how DataTools Pro protects your data and keeps our Salesforce AppExchange solutions secure and available.\n\n*Last updated: 2025-10-10*\n\n---\n\n## Our Commitment\n\n- **Security by design** across the full software lifecycle.\n- **Privacy first**: we collect the minimum required to operate the service.\n- **Transparency**: clear documentation, responsible disclosure, and uptime reporting.\n\n## What We Operate\n\n- **Products:** Salesforce AppExchange managed package(s), web app/portal, and public APIs.\n- **Hosting:** AWS US-West1 is our primary AZ\n- **Tenancy:** Shared‑schema (single‑schema), logically isolated by customer; strict least‑privilege access enforced.\n\n## Security by Design (SSDLC)\n\n- Threat modeling for new features and major changes.\n- Secure coding standards; peer reviews; automated SAST/DAST and dependency scanning.\n- Infrastructure as Code with policy guardrails and change approvals.\n\n## Data Protection\n\n- **In transit:** TLS 1.2+.\n- **At rest:** AES‑256 encryption for databases, object storage, and backups.\n- **Access control:** Role‑based access (RBAC), MFA for admin accounts, least‑privilege and just‑in‑time elevation.\n- **Audit logging:** Centralized, immutable logs for admin actions, data exports, and auth events.\n\n## Tenancy Model\n\nWe operate a **shared-schema, logically isolated** architecture. All data access is scope-limited by a required per-tenant identifier enforced through database row-level policies and application-level checks. Administrative actions, background jobs, caches, logs, and exports are tenant-aware. We continuously monitor for cross-tenant access and enforce least-privilege service roles.\n\n**Why this meets Salesforce expectations:** Salesforce’s security review accepts logical segregation when it’s properly enforced. Our design implements layered controls (DB policies + application checks), tenant-aware operations, monitoring, and auditable access trails to demonstrate effective isolation.\n\n## Compliance & Assurance\n\n- **Independent testing:** We conduct annual third‑party penetration testing; an executive summary is available on request (under NDA).\n- **Control alignment (not certified):** We align our controls to SOC 2 (Security, Availability, Confidentiality). We are not currently SOC 2 certified.\n- **Policies:** Information Security, Incident Response, Business Continuity, Vendor Risk, Vulnerability Management.\n\n## Privacy & Data Residency\n\n- Data minimized to business need; retention aligned to contract and law.\n\n## Subprocessors\n\nWe use carefully vetted service providers for hosting, monitoring, and support.\n\n- Cloudways / AWS\n- AWS\n- Cloudflare\n\n## Availability & Continuity\n\n- Nightly encrypted backups; periodic restore tests.\n- Documented Disaster Recovery and Business Continuity plans, exercised at least annually.\n- Status and uptime history:\n\n## Customer Responsibilities\n\nSecurity is a shared responsibility. We recommend:\n\n- Enforce SSO/MFA for your users and administrators.\n- Grant least‑privilege roles and review access regularly.\n- Keep Salesforce/org IP allowlists and data sharing rules current.\n- Follow our hardening guides and apply updates promptly.\n\n## Responsible Disclosure\n\nWe value the security research community. If you believe you’ve found a vulnerability:\n\n1. Email **support@datatoolspro.com** with details and steps to reproduce.\n\nWe do not offer a public bounty program today, but we acknowledge researchers who responsibly report issues and qualify for safe harbor under our policy.\n\n## How to Reach Us\n\n- **Security & Privacy:** **support@datatoolspro.com**\n- **Support:** support@datatoolspro.com\n\n---\n\n### Quick FAQ\n\n**Do you store my Salesforce credentials?**\nNo. We rely on secure OAuth flows and store tokens with AES 256 encryption. We never store tokens in code or logs.\n\n**Where is my data stored?**\nAWS West1 is our primary AWS region. We utilize AWS RDS for data storage. Region pinning may be available for enterprise tiers. Contact our support team for more details.\n\n**Can I get your latest security report?**\nYes. Our annual third‑party penetration test executive summary is available on request (under NDA).\n\n**How fast do you remediate critical issues?**\nWe prioritize immediate mitigation (hours) and target permanent fixes within days based on severity.\n\n---\n\n## Subprocessors\n\n| Subprocessor | Role | Data Types | Primary Locations |\n| --- | --- | --- | --- |\n| **Amazon Web Services, Inc. (AWS)** | Infrastructure provider (compute, RDS, object storage, web application logging/monitoring) | Application data stored in databases and object storage; operational logs/metrics | Primary AZ – US West -1 |\n| **Cloudways Ltd.** | **Managed hosting layer** operating on AWS infrastructure (provisioning/orchestration, maintenance, limited administrative access) | Same categories as hosted workload when providing management services; operational metadata | Same AWS regions as above (infrastructure resides on AWS) |\n| **Cloudflare, Inc.** | DNS, CDN, WAF, DDoS protection | IP addresses, request headers, URLs, cached static assets | Global edge network; origin in AWS region(s) above |\n\n**Trust Center Resources**\n\n- [Security FAQ](https://datatoolspro.com/datatoolspro-data-security-faq/ \"DataToolsPro Data Security FAQ\")"
}