{
  "post_id": 10126,
  "title": "Salesforce Reports and Dashboards DataTools Overview",
  "slug": "salesforce-reports-and-dashboards",
  "url": "https://datatoolspro.com/tutorials/salesforce-reports-and-dashboards/",
  "date": "2024-10-17T12:11:38",
  "modified": "2024-11-17T19:13:24",
  "categories": [
    "DataTools Pro"
  ],
  "tags": [
    "Reports and Dashboards DataTools"
  ],
  "excerpt": "Filter Panel DataTools Pro comes jam packed with filters so you can slice, dice, and search for reports that are important to you The following filters are currently included: Views Views are designed to provide common segments of reports that you need quick access to. DataTools Pro views are constructed as pre-defined filters. If there […]",
  "content_markdown": "- [Why does Salesforce Reports and Dashboards DataTools Exist?](#aioseo-why-does-salesforce-reports-and-dashboards-datatools-exist)\n- [Filter Panel](#aioseo-filter-panel)\n  - [Views](#aioseo-views)\n  - [Analytics Type](#aioseo-analytics-type)\n  - [Line of Business](#aioseo-line-of-business)\n  - [Topic](#aioseo-topic)\n  - [Date Created Filter](#aioseo-date-created-filter)\n  - [Date Last Modified Filter](#aioseo-date-last-modified-filter)\n  - [Date Last Viewed on](#aioseo-date-last-viewed-on)\n  - [Status](#aioseo-status)\n  - [Created by](#aioseo-created-by)\n  - [Modified by](#aioseo-modified-by)\n- [Managing Dashboard and Report lifecycle with Status](#aioseo-managing-dashboard-and-report-lifecycle-with-status)\n- [Tag Salesforce Reports and Dashboards by line of business and topic](#aioseo-tag-salesforce-reports-and-dashboards-by-line-of-business-and-topic)\n- [DataTools Pro refresh Salesforce analytics list](#aioseo-datatools-pro-refresh-salesforce-analytics-list)\n\n## Why does Salesforce Reports and Dashboards DataTools Exist?\n\nDataTools for Salesforce Reports and Dashboards management was built to make it easier to find, track, and manage report and dashboard lifecycle over time. Salesforce provides a very powerful dashboard and reporting function that is great for real-time operational reporting. Self service can create challenges for organizations that need a single and consistent source of truth. We are working to bring the data and analytics management capabilities into Salesforce workstreams.\n\n## Filter Panel\n\nDataTools Pro comes jam packed with filters so you can slice, dice, and search for reports that are important to you The following filters are currently included:\n\n![](https://datatoolspro.com/wp-content/uploads/2024/10/image-1-png.webp)\n\n#### **Views**\n\nViews are designed to provide common segments of reports that you need quick access to. DataTools Pro views are constructed as pre-defined filters. If there is a common view you want to see, feel free to request it from our team!\n\n[Learn about Views](https://datatoolspro.com/tutorials/salesforce-report-and-dashboard-views/ \"Salesforce Report and Dashboard VIews\")\n\n#### **Analytics Type**\n\nFilter by type of analytics based on technology and type of output. Current supported Analytics types include:\n\n- Salesforce Reports\n- Salesforce Dashboards\n\n#### **Line of Business**\n\nCategorize your reports and dashboards by line of business that utilize reports and dashboards. DataTools Pro allows you to add one or multiple lines of business specific to your organization.\n\n[How to Tag Reports and Dashboards](https://datatoolspro.com/tutorials/tag-salesforce-reports/ \"Tag Salesforce Reports\")\n\n#### **Topic**\n\nTopics is a tagging feature allowing you to categorize and segment your reports and dashboards based on business topics. This can be KPIs, initiatives, business processes and workflows or anything that you want quick access to.\n\n[How to Tag Reports and Dashboards](https://datatoolspro.com/tutorials/tag-salesforce-reports/ \"Tag Salesforce Reports\")\n\n#### **Date Created Filter**\n\nFilter reports based on the relative or absolte dates that a report was created. This is quite helpful to quickly locate reports and dashboards that you or team members have recently introduced.\n\n#### **Date Last Modified Filter**\n\nFilter reports based on the relative or absolute dates that a report was modified. This filter can be used to locate reports and dashboards that you or team members have recently worked on.\n\n#### **Date Last Viewed on**\n\nSalesforce tracks the last date a dashboard and report is viewed, which is extremely useful to determine adoption and utilization of reports. When reports age or become less relabent, it is difficult to determine quickly reports that should be purged. Similarly for newly deployed reports and dashboards, using Last Viewed is helpful to ensure work your team completes is generating value.\n\n#### **Status**\n\nDataTools Pro allows you to set a report and dashboard status, which is related to lifecycle management. Reports and dashboards that are under development, in production, or deprecated and marked for deletion. Stautses included in DataTools Pro includes:\n\n- **Working**\n- **Production**\n- **Deprecated**\n\n[Using Status to manage dashboards and reports](https://datatoolspro.com/tutorials/manage-salesforce-dashboard-lifecycle-with-status/)\n\n#### **Created by**\n\nCreated by filter allows you to constrain reports that you create or other members of your organization. The created by filter only includes names of users in your org that have authored reports.\n\n#### **Modified by**\n\nModified by filter allows you to constrain reports that you create or other members of your organization. The created by filter only includes names of users in your org that have modified reports.\n\n## Managing Dashboard and Report lifecycle with Status\n\nDataTools Pro simplifies the process of tracking a Salesforce dashboard lifecycle using a simple status field.\n\n- **Production**: Reports and dashboards actively used by business units or individuals.\n- **In Progress/Development**: Reports still being built, tested, or validated.\n- **Deprecated**: Reports that are no longer used and should be flagged for removal.\n\n[Learn more about dashboard and report status](/tutorials/manage-salesforce-dashboard-lifecycle-with-status/ \"Salesforce report and dashboard status\")\n\n![](https://datatoolspro.com/wp-content/uploads/2024/10/image-2-png.webp)\n\n## Tag Salesforce Reports and Dashboards by line of business and topic\n\nDataTools Pro lets you tag Reports and Dashboards by line of business and topic, making it easy to categorize and organize your analytics. With this additional contextual information how you can quickly filter and explore the insights that matter most.\n\n[Learn how to categorize, organize, and filter your reports better](/tutorials/tag-salesforce-reports \"Categorize your Salesforce Reports\")\n\n![](https://datatoolspro.com/wp-content/uploads/2024/10/image-3-png.webp)\n\n## DataTools Pro refresh Salesforce analytics list\n\nDataTools Pro loads and refreshes your Salesforce analytics lists (reports and dashboards) to ensure you’re working with the latest data. Updates made in Salesforce won’t appear in DataTools Pro until you click “Refresh,” giving you control over syncing changes. This approach is designed to support active workflows while conserving your organization’s Salesforce API credits.\n\n[Learn more about Refresh and Scheduler](https://datatoolspro.com/tutorials/refresh-salesforce-analytics/ \"Refresh and Schedule\")\n\n![DataTools Pro refresh Salesforce analytics](https://datatoolspro.com/wp-content/uploads/2024/11/image-48-png.webp)"
}