{"post_id": 10371, "title": "Tag Salesforce Reports and Dashboards by line of business and topic", "slug": "tag-salesforce-reports", "url": "https://datatoolspro.com/tutorials/tag-salesforce-reports/", "date": "2024-11-17T17:53:07", "modified": "2024-11-17T17:56:50", "categories": ["DataTools Pro"], "tags": ["datatoolspro", "Reports and Dashboards DataTools"], "excerpt": "Categorizing your Assets: Tagging and Taxonomy Options Adding and Editing Topics from Settings There are multiple locations within DataTools Pro where you can potentially add and edit your Lines of Business and Topics. 1. In the top right toolbar, click on the Settings gear icon 2. Go to the Settings page in DataTools Pro and […]", "content_markdown": "- [Categorizing your Assets: Tagging and Taxonomy Options](#aioseo-categorizing-your-assets-tagging-and-taxonomy-options)\n- [Adding and Editing Topics from Settings](#aioseo-adding-and-editing-topics-from-settings)\n- [Adding and Editing Categories from Metrics or Dashboard and Reports Info Windows](#aioseo-adding-and-editing-categories-from-metrics-or-dashboard-and-reports-info-windows)\n- [Assign Categories to a Single Metric, Report or Dashboard](#assignsinglecategory)\n- [Remove an assigned categories to a Metric, Report or Dashboard](#aioseo-remove-an-assigned-categories-to-a-metric-report-or-dashboard)\n- [Bulk Assign Categories to a Single Metric, Report or Dashboard](#bulkassigncategories)\n- [Permissions (Team and Enterprise Versions)](#aioseo-permissions-team-and-enterprise-versions)\n\nDataTools Pro free Salesforce app allows you to tag Salesforce Reports and Dashboards by line of business and topic. Semantics and taxonomies are terms that mean you are simply categorizing your assets. When it comes to analytics you want to categorize your metrics, reports, and dashboards in a way describes how you manage your business! That is why we created a feature that allows you to categorize, Reports & Dashboards and Metrics so you can easily filter and explore.\n\n## Categorizing your Assets: Tagging and Taxonomy Options\n\n**Line of Business**\n\nThe most common taxonomy for an enterprise that is generally universal is line of business. That is why we have added Line of Business a standard DataTools Pro tag type.\n\n**Custom Categories**\n\nFeel free to contact us for more information how to create and use custom tags and taxonomies.\n\n**Topics**\n\nTopic is a general tag that can vary by organization. Within DataTools Pro, we wanted to provide maximum flexibility for users to define their own topics.\n\n[Video: Tag Salesforce Reports and Dashboards by Line of Business and Topic](https://www.youtube.com/embed/ZLpZTLZZAHI?feature=oembed)\n\n## Adding and Editing Topics from Settings\n\nThere are multiple locations within DataTools Pro where you can potentially add and edit your Lines of Business and Topics.\n\n1. In the top right toolbar, click on the **Settings** gear icon\n\n![](https://datatoolspro.com/wp-content/uploads/2024/11/image-32-png.webp)\n\n2. Go to the **Settings** page in DataTools Pro and scroll down to the Categories section.\n\n![Tag Salesforce Reports](https://datatoolspro.com/wp-content/uploads/2024/11/image-31-png.webp)\n\n3. **Add and Edit Lines of Business and Topics**:\nYou will find two categories: **Lines of Business** and **Topics**. Use the spreadsheet interface to easily add new tags or edit existing ones.\n\n![](https://datatoolspro.com/wp-content/uploads/2024/11/image-33-png.webp)\n\n**Examples**:\n\n- **Lines of Business**: Product, Marketing, Sales, Support.\n- **Topics**: Customer Acquisition, Retention, Funnel Analysis.\n\n## Adding and Editing Categories from Metrics or Dashboard and Reports Info Windows\n\nWhen you view an individual Metric, Report, or Dashboard info-window, you can assign a category and also add new categories for convenience.\n\n1. Select a Metric, Report or Dashboard to display the info-window.\n\n![Select infowindow](https://datatoolspro.com/wp-content/uploads/2024/11/image-35-png.webp)\n\n2. Scroll the Line of Business and Topic section.\n\n3. Click the edit icon (pencil).\n\n![](https://datatoolspro.com/wp-content/uploads/2024/11/image-34-png.webp)\n\n4. Go to the “Not Related” sub tab to display a list of categories not associated with the Metric, Report or Dashboard\n\n![](https://datatoolspro.com/wp-content/uploads/2024/11/image-36-png.webp)\n\n5. Click the “Add” button to add a new category, or click on a category in the list to assign it to the Metric, Report or Dashboard.\n\n## Assign Categories to a Single Metric, Report or Dashboard\n\nWhen you view an individual Metric, Report, or Dashboard info-window, you can assign a category and also add new categories for convenience.\n\n1. Select a Metric, Report or Dashboard to display the info-window.\n\n![Select infowindow](https://datatoolspro.com/wp-content/uploads/2024/11/image-35-png.webp)\n\n2. Scroll the Line of Business and Topic section.\n\n3. Click the edit icon (pencil).\n\n![](https://datatoolspro.com/wp-content/uploads/2024/11/image-34-png.webp)\n\n4. By default, if you have not assigned a category (line of business or topic) to the record you selected, you will see “Not Related” by default. If you have a category already assigned, click on the “Not Related” sub tab to display a list of categories not associated with the Metric, Report or Dashboard\n\n![](https://datatoolspro.com/wp-content/uploads/2024/11/image-36-png.webp)\n\n5. Click on the Line of Business or Category in the list to relate the category to your metric, report or dashboard.\n\nNOTE: The “Add” button is to create a brand new category and is not used to relate your category.\n\n## Remove an assigned categories to a Metric, Report or Dashboard\n\nTo remove a category relationship to a Metric, Report or Dashboard:\n\n1. Select a Metric, Report or Dashboard to display the infowindow.\n\n![Select infowindow](https://datatoolspro.com/wp-content/uploads/2024/11/image-35-png.webp)\n\n2. Scroll the Line of Business and Topic section.\n\n3. Click the edit icon (pencil).\n\n![](https://datatoolspro.com/wp-content/uploads/2024/11/image-34-png.webp)\n\n4. Click the “Trash” icon to move the related category back to “Not Related”\n\n![](https://datatoolspro.com/wp-content/uploads/2024/11/image-37-png.webp)\n\n## Bulk Assign Categories to a Single Metric, Report or Dashboard\n\nDataTools Pro allows you to bulk select Metrics, Dashboards and Reports so you can bulk update categories and status. To complete this task:\n\n1. Select the first record in your desired bulk selection\n\n![](https://datatoolspro.com/wp-content/uploads/2024/11/image-38-png.webp)\n\n2. **Bulk select additional records 1 by 1:**\n\nHold the **Ctrl** button on your keyboard and click on the individual records that you would like to bulk edit\n\n![](https://datatoolspro.com/wp-content/uploads/2024/11/image-39-png.webp)\n\n2. **Bulk select records in sequence from first selected**\n\nHold the **Shift** button on your keyboard and click the last record in sequence that you would like to select. DataTools will auto-select all records in between.\n\n![](https://datatoolspro.com/wp-content/uploads/2024/11/image-40-png.webp)\n\n3. Click on the “Edit X Metrics” button\n\n4. Select the category (Line of Business or Topic)\n\n![](https://datatoolspro.com/wp-content/uploads/2024/11/image-41-png.webp)\n\n5. Select 1 or multiple categories.\n\n6. Press “Assign” to bulk assign the categories.\n\n7. Close the window by clicking the close icon or click outside of the popup window.\n\n## Permissions (Team and Enterprise Versions)\n\nWe provide controls to restrict who can implement and modify tags within DataTools Pro.\n[Learn how to manage users and permissions](https://datatoolspro.com/tutorials/manage-datatools-pro-account-and-users/)"}