{
  "post_id": 11061,
  "title": "How to Generate Snowflake Client ID and Secret for OAuth",
  "slug": "how-to-generate-snowflake-client-id-and-secret-for-oauth",
  "url": "https://datatoolspro.com/tutorials/how-to-generate-snowflake-client-id-and-secret-for-oauth/",
  "date": "2025-01-02T00:47:39",
  "modified": "2025-01-02T19:09:53",
  "categories": [
    "DataTools Pro"
  ],
  "tags": [
    "datatools",
    "Migration",
    "Snowflake"
  ],
  "excerpt": "Acquire your Snowflake Account Account and org names in Snowflake can be tricky. The easiest and fastest way to acquire the correct account identifier is to: To integrate your Snowflake account with DataTools Pro, you need to create a Custom Client Integration in Snowflake. This process involves setting up an OAuth-based security integration within Snowflake, which […]",
  "content_markdown": "![](https://datatoolspro.com/wp-content/uploads/2025/01/image-3-1024x620.webp)\n\n## Acquire your Snowflake Account\n\nAccount and org names in Snowflake can be tricky. The easiest and fastest way to acquire the correct account identifier is to:\n\n1. Login to Snowfake\n2. In the lower left corner, click on your profile icon to show settings\n3. Hover over your account to display the account, org, and locator screen.\n4. Clock on the copy to clipboard icon as circled in the screenshot below.\n\n![](https://datatoolspro.com/wp-content/uploads/2025/01/image-2-png.webp)\n\nTo integrate your Snowflake account with DataTools Pro, you need to create a **Custom Client Integration** in Snowflake. This process involves setting up an OAuth-based security integration within Snowflake, which will generate a **Client ID** and **Client Secret** necessary for secure communication between Snowflake and our app.\n\n## Steps to Create a Custom Client Integration:\n\n**Create the Security Integration**: Start by running the following command within your Snowflake environment to create the integration:\n\n```sql\nCREATE SECURITY INTEGRATION dtp_oauth_integration TYPE = OAUTH ENABLED = TRUE OAUTH_CLIENT = 'CUSTOM' OAUTH_CLIENT_TYPE = 'CONFIDENTIAL' OAUTH_REDIRECT_URI = 'https://app.datatoolspro/auth/snowflake/callback' OAUTH_ISSUE_REFRESH_TOKENS = TRUE OAUTH_REFRESH_TOKEN_VALIDITY = 7776000;\n```\n\n`OAUTH_REFRESH_TOKEN_VALIDITY` is setup for 90 days, which may or may not adhere to your own organization’s token refresh policy. DataTools Pro will fetch a new refresh token based on the interval you set.\n\n**Retrieve the Client ID and Client Secret**: After creating the security integration, run the following command to retrieve the **Client ID** and **Client Secret**:\n\n**Note:** The integration name should be capitalized in the code.\n\n```sql\nSELECT SYSTEM$SHOW_OAUTH_CLIENT_SECRETS('DTP_OAUTH_INTEGRATION');\n```\n\n## Important Notes:\n\n- The **Redirect URI** is the most important field in this process. It must exactly match the URL we provided for the OAuth callback. Any discrepancies will cause errors during the OAuth authentication process.\n- Once you have generated the **Client ID** and **Client Secret**, please enter them in the form below. This will allow us to securely link your Snowflake integration with our platform.\n\nBy following these steps, you will successfully create a custom OAuth client integration, enabling secure and seamless communication between Snowflake and our application.\n\n## Setting up a System User\n\nWe recommend setting up a System user with read-only access to your Snowflake schema within the database(s) you would like to use with DataTools Pro. This ensures your least level of access privileges restricts direct access to your meta data only.\n\n![](https://datatoolspro.com/wp-content/uploads/2025/01/image-4-1024x908.webp)\n\nExample code to generate the SYSTEM\\_DTPAPP\\_USER user and a role called METADATA\\_ACCESS\\_ROLE\n\n```sql\n-- Step 1: Create the user\nCREATE USER SYSTEM_DTPAPP_USER\nPASSWORD = '<<YOUR_SECURE_STRONG_PASSWORD>>'\nDEFAULT_ROLE = 'METADATA_ACCESS_ROLE'\nCOMMENT = 'User with access only to metadata for a specific database'\nMUST_CHANGE_PASSWORD = FALSE;\n\n-- Step 2: Create a role for metadata access IF ONE DOES NOT EXIST\nCREATE ROLE METADATA_ACCESS_ROLE;\n\n-- Step 3: Grant usage on the database and schema to the role\n-- NOTE: Replace <<YOUR_DATABASE>> with the name of your target database\nGRANT USAGE ON DATABASE <<YOUR_DATABASE>> TO ROLE METADATA_ACCESS_ROLE;\nGRANT USAGE ON ALL SCHEMAS IN DATABASE <<YOUR_DATABASE>> TO ROLE METADATA_ACCESS_ROLE;\n\n-- Step 4: Grant access to metadata (SELECT on information schema views)\n-- NOTE: Replace <<YOUR_DATABASE>> with the name of your target database\nGRANT SELECT ON ALL VIEWS IN SCHEMA <<YOUR_DATABASE>>.INFORMATION_SCHEMA TO ROLE METADATA_ACCESS_ROLE;\n\n-- Step 5: Assign the role to the user\nGRANT ROLE METADATA_ACCESS_ROLE TO USER SYSTEM_DTPAPP_USER;\n```\n\n## Snowflake Network Policy Considerations\n\nYour Snowflake org may have network rules and an active network policy in place already. To adhere and grant access to DataTools Pro to connect to your Snowflake instance, you will need to obtain the DataTools Pro IP address to add it to your Snowflake network policy: [Learn more about configuring Snowflake Network policy](https://datatoolspro.com/tutorials/snowflake-user-network-policy/ \"Snowflake Network Policy\")\n\n#### Locate DataTools Pro IPs to add to your Snowflake Network Rules / Policy\n\n1. Login to [DataTools Pro App](https://app.datatoolspro.com \"DataTools Pro App\")\n2. Go to Settings\n3. Click on Snowflake Integration\n4. Click on the accordion menu item labeled “How to whitelist DataTools Pro IP address”\n5. Obtain the IP address to ensure you have the latest IPs for your region.\n\n[Documentation for creating and adding IPs to a Network policy](https://datatoolspro.com/tutorials/snowflake-user-network-policy/ \"Setting Up a Snowflake User Network Policy IP Whitelist\")"
}