{
  "post_id": 8952,
  "title": "Data Tools Object and ERD Views",
  "slug": "data-tools-erd-and-object-views",
  "url": "https://datatoolspro.com/tutorials/data-tools-erd-and-object-views/",
  "date": "2023-12-01T21:44:59",
  "modified": "2024-09-17T23:43:39",
  "categories": [
    "DataTools Pro"
  ],
  "tags": [
    "datatoolspro",
    "ERD"
  ],
  "excerpt": "DataTools Object and ERD Views are designed to organize collections of Salesforce objects based on business semantics and topics",
  "content_markdown": "DataTools provides the ability to create custom ERD views to organize collections of Salesforce objects based on business semantics and topics. This provides a clear way to visually community the relationship between your Salesforce objects and topics, processes, and operating groups.\n\nViews are extremely useful for:\n\n- Collaborate organize information communicate with less clutter\n- Visualize line of business ownership over data objects\n- Separation in business process across objects.\n- Salesforce modules industries\n- 3rd party apps and integrations\n- Isolate phases of marketing, sales, and service lifecycle by object\n\n## **Using Views Panel**\n\nThe view dropdown is available on object dictionary, migration, or entity relationship.\n\nYou can select pre-created views or create new ones (based on your permissions).\n\nWhen changing a view on the Dictionary and Migration pages, you will see a finite number of objects in your dictionary.\n\n![](https://datatoolspro.com/wp-content/uploads/2023/12/image-1024x308.png)\n\n## Entity Diagram ERD Views\n\nWhen toggling views in the Entity Diagram, your diagram will re-render. When using the view editor, you will need to save your view to hide objects in the diagram.\n\n![](https://datatoolspro.com/wp-content/uploads/2023/12/image-5.png)\n\n## **Create Views**\n\n1. Click on the “Edit Views” button\n\n2. From the “All” views option, you can immediately start un-checking objects.\n\n![Salesforce ERD Views](https://datatoolspro.com/wp-content/uploads/2023/12/image-1.png)\n\n3. To name and save your new view, press the “+” or click on the link to “Add your View”.\n\n![DataTools ERD Views](https://datatoolspro.com/wp-content/uploads/2023/12/image-3.png)\n\n4. Enter your ERD view name and press the checkbox to save your view and apply your changes.\n\n## View Options\n\nWe are always looking for ways to enhance views for you. When you create a view you can toggle settings based on your audience and purpose.\n\n#### Show User Relationships\n\nUsers are technically related to every object, sometimes multiple times. While this relationship is important to understand, visually it is noisy. We give you the option to show or hide the user relationships.\n\n#### Field API Name\n\nFor admins, developers, and data workers API names are very important. However, business users understand Salesforce fields based on their label. DataTools Pro has a toggle for both.\n\n#### Show External Id\n\nWhen connecting and integrating Salesforce to external data sources and apps, you will use external IDs. DataTools Pro will recognize external IDs and display them in the ERD with a different color icon.\n\n![Salesforce External IDs](https://datatoolspro.com/wp-content/uploads/2023/12/image-23-1024x642.png)\n\n## **Edit ERD Views**\n\n1. Click on the “Edit Views” button\n\n2. Click on the “Edit” icon or start checking/unchecking icons to expose a message that will prompt you to “Edit your View”.\n\n3. You can check/uncheck objects and update the name of your view.\n\n4. Press the save / checkbox to confirm your updates.\n\n![](https://datatoolspro.com/wp-content/uploads/2023/12/image-4.png)\n\n## **Delete ERD Views**\n\n1. Click on the “Edit Views” button\n\n2. Click on the Delete / Track icon located under the object checkboxes."
}