{
  "post_id": 9170,
  "title": "Migration Export SQL",
  "slug": "migration-export-sql",
  "url": "https://datatoolspro.com/tutorials/migration-export-sql/",
  "date": "2024-01-20T18:39:06",
  "modified": "2024-01-20T19:04:47",
  "categories": [
    "DataTools Pro"
  ],
  "tags": [
    "datatoolspro",
    "Migration"
  ],
  "excerpt": "Linking metrics allows you to capture and understand how metrics relate to each other and provides categorization that aligns to typical business cases.",
  "content_markdown": "[DataTools Pro migration tab](https://datatoolspro.com/tutorials/salesforce-migration-field-mapping-details) prepares SQL preview of your mapped data to help expedite translating your mapping to code for ETL (extract, transform, load).\n\n**Background:** Typical data migrations with a larger number of source tables, or systems with complex source schemas require staging the data and transforming it. Even Salesforce to Salesforce data migrations can require complex join transformation functions. To help translate data mapping to executable code DataTools Pro features a SQL export:\n\n![](https://datatoolspro.com/wp-content/uploads/2024/01/image-27.png)\n\n## **Export to SQL**\n\n1. Navigate to the Migration tab\n\n2. Click the “Export Database SQL” icon\n\n![](https://datatoolspro.com/wp-content/uploads/2024/01/image-28.png)\n\nWithin a popup modal window you will see a SQL code representation of your data mapping.\n\n![](https://datatoolspro.com/wp-content/uploads/2024/01/image-30-1024x439.png)\n\n3. Select the appropriate syntax options based on the database you are exporting to.\n\n**Syntax Option Examples:**\n\n| **DB Name** | **Objects and Fields** | **NULL / Placeholders** | **Static Value** (strings and literals) |\n| --- | --- | --- | --- |\n| Snowflake | Double Quotes | NULL | Single Quotes |\n| SQL | Brackets [] or Double Quotes | NULL | Single Quotes |\n| MySQL | Backticks \\` or otherwise can be set to “None” | NULL | Single Quotes |\n| POSTGRESQL | Double Quotes | NULL | Single Quotes |\n\n4. Click the “Copy to Clipboard” to copy the code for use in your database management or ETL tool.\n\n## **Multiple Objects Mapping Impact to SQL**\n\nIn the event your data source has multiple source objects that map into a single Salesforce object, you have flexibility to map each source object independently inside of DataTools Pro. As a result, DataTools Pro will pre-fix the mapped field based on the source object.\n\n![](https://datatoolspro.com/wp-content/uploads/2024/01/image-31.png)\n\n## **Tips**\n\nWhen performing data migrations, we typically use the output code inside of a CTE, Common Table Expression. A CTE is a result set of a query which exists temporarily and for use only within the context of a larger query. This allows your ETL developers to perform joins and implement transformations independent of your data mapping. In addition to the DataTools Pro generated SQL code, we typically hand off the following to demonstrate to our ETL developer perform their data transformations and joins. Here is a typical flow of information.\n\nAs new transformed fields are introduced you can [update your source data fields / schema](https://datatoolspro.com/tutorials/salesforce-migration-field-mapping-details#addsourcefields \"Update Source Data fields in DataTools Pro\") inside of DataTools Pro.\n\n```sql\nWITH DataProcessingCTE AS (\n    -- Perform the complex data transformations here.\n    -- This can include joins, aggregations, case statements, etc.\n    -- This example is simplified and should be expanded based on your data transform needs\n\n    SELECT *\n        -- Select from your source table in your database\n    FROM\n    <<YOUR DATABASE>>.<<YOUR SCHEMA>>.<<YOUR SOURCE TABLE>>\n),\n\n<<OBJECT NAME FROM DATATOOLS SQL>> AS (\n    -- Optional: Any additional transformations that build on the previous CTE. Possibly fine tuning, renaming or calculated logic.\n\n    SELECT *\n        -- Further processing based on the previous CTE\n    FROM DataProcessingCTE\n)\n\n    -- Data Tools Generated SQL code intended to only map values as defined by DataTools.\n\n-- <<PASTE DATATOOLS PRO SQL OUTPUT HERE>>\n```"
}