{
  "post_id": 11976,
  "title": "Salesforce Admin DataTools Pro Install Guide",
  "slug": "salesforce-admin-install-guide",
  "url": "https://datatoolspro.com/tutorials/salesforce-admin-install-guide/",
  "date": "2025-10-18T10:52:27",
  "modified": "2025-10-18T11:29:22",
  "categories": [
    "DataTools Pro"
  ],
  "tags": [
    "datatoolspro",
    "documentation"
  ],
  "excerpt": "We created this article to explain DataTools Pro connected app, updated with the latest Salesforce requirements for connected apps. DataTools Pro was built to extend the value of Salesforce metadata to non-Salesforce admins. These are data, analytics, and product owners who need to understand and access Salesforce metadata as part of their job. If you […]",
  "content_markdown": "We created this article to explain DataTools Pro connected app, updated with the latest Salesforce requirements for connected apps. DataTools Pro was built to extend the value of Salesforce metadata to non-Salesforce admins. These are data, analytics, and product owners who need to understand and access Salesforce metadata as part of their job.\n\n***If you received a link to this article from a user in your Salesforce org, they are likely unable to install and configure DataTools Pro.***\n\n## **Why can’t non-Salesforce admins install Salesforce connected apps**\n\nBefore Oct 2025, any user could set up and authenticate into Salesforce and start using DataTools Pro. Due to a number of high-profile social engineering security breaches, Salesforce implemented changes that impact all customers and OAuth Connected Apps. Our opinion is that the change is good, but the end user experience, guided workflows, approval processes, and user experiences need a lot of work.\n\nOur proactive approach as an enterprise-focused startup was to engage the community and provide as much information as possible to ensure we can continue to support Salesforce as a core DataTools Pro integration\n\n**Read the Official Salesforce Documentation**\n\n[Salesforce Changes: Connected Apps](https://admin.salesforce.com/blog/2025/get-ready-for-changes-to-connected-app-usage-restrictions)\n\n**See what the community is saying about connected apps on Reddit:** [https://www.reddit.com/r/salesforce/comments/1o4j98i/comment/njx4qtg/?context=3](https://www.reddit.com/r/salesforce/comments/1o4j98i/comment/njx4qtg/?context=3 \"Connected Apps\")\n\n## How to Configure Salesforce Connected Apps for Non Salesforce Admin Users\n\n[Step 1: Sign Up for DataTools Pro as a Salesforce Admin](/beta?source=article-admin-installguide)\n\nStep 2: Confirm email one-time email authorization (we validate the authenticity of email)\n\nStep 3: Log in with Salesforce to authorize access to DataTools Pro (link provided in email)\n\nStep 4. Open Salesforce as Salesforce Admin, and Open your Connected Oauth Apps\n\n![](https://datatoolspro.com/wp-content/uploads/2025/10/image-3.webp)\n\nStep 5. Find DataTools Pro\n\nStep 6. Click “Install” – This provides control to Salesforce admins with visibility and control over app Policies.\n\n![](https://datatoolspro.com/wp-content/uploads/2025/10/image-1-1024x99.webp)\n\nRestricting Salesforce Connected App to DataTools Pro IPs\n\n## Enhance Security With IP Allow-Listing *(Optional but Recommended)*\n\nFor added security, we recommend **restricting DataTools Pro access** to our **trusted infrastructure**:\n\n1. In Salesforce, go to:\n   **Setup → Security → Network Access**.\n2. Add the following **static IPs** used by DataTools Pro:\n\n```\n13.52.124.40\n3.224.67.34\n13.52.124.40\n```\n\n## DataTools Pro and Salesforce\n\nOur team at DataTools Pro went through the process to abide by Salesforce security best practices\n\n[**Connected Apps Security Guide**](https://developer.salesforce.com/docs/atlas.en-us.securityImplGuide.meta/securityImplGuide/connected_apps.htm)\n\n## DataTools Pro Security\n\n[Read our Security FAQ](https://datatoolspro.com/datatoolspro-data-security-faq/ \"DataTools Pro Security FAQ\")\n\n[Read Our DataTools Pro Security Policy](https://datatoolspro.com/tutorials/security-policy-salesforce-connected-app/ \"DataTools Pro Security Policy\")\n\nDataTools Pro for Salesforce is a metadata management toolset. To get a complete and detailed explanation of DataTools security and access, we have prepared a [Security FAQ](https://datatoolspro.com/datatoolspro-data-security-faq/ \"DataTools Pro Security FAQ\") and [Security Policy](https://datatoolspro.com/tutorials/security-policy-salesforce-connected-app/ \"DataTools Pro Security Policy\") : DataTools Pro security. DataTools Pro for individual contributors is free. We are an enterprise-focused B2B software company, and we do not access, train, or process data in any way outside of your tenant.\n\nFeel free to send us an email or schedule a call if you require any additional information.\n\n## **Learn About DataTools Pro Before Installing**\n\nIn short, DataTools Pro is a connected app that helps Salesforce admins and non-administrative users manage metadata assets like data dictionaries, conceptual ERDs, metrics glossaries, and reports/dashboards from Salesforce, Tableau, CRMA, and others.\n\n### **Why did we create DataTools Pro ?**\n\nAs a Salesforce admin, there are tools inside the platform that give you access to all metadata. However, the utility and ability to manage change and scale are major pain points when across teams for data, analytics, and internal product/project stakeholders and contributors. That is why we built DataTools Pro.\n\n[Learn about DataTools Pro Features and Functions](/datatools-for-salesforce/ \"DataTools Pro for Salesforce\")\n\n[View complete DataTools Knowledge Hub](/support)"
}