{
  "post_id": 9190,
  "title": "Object Explorer for DataTools Pro Dictionary",
  "slug": "object-explorer-for-datatools-pro-dictionary",
  "url": "https://datatoolspro.com/tutorials/object-explorer-for-datatools-pro-dictionary/",
  "date": "2024-01-20T20:19:11",
  "modified": "2025-01-07T14:41:48",
  "categories": [
    "DataTools Pro"
  ],
  "tags": [
    "datatoolspro",
    "Dictionary"
  ],
  "excerpt": "DataTools Pro Dictionary provides Salesforce object exploration. By design, the object exploration is designed for fast access to the most important object views aligned to your business.",
  "content_markdown": "[DataTools Dictionary](https://datatoolspro.com/salesforce-dictionary-app/ \"Free Smart Salesforce Dictionary Data Tools\") provides Salesforce object exploration for your data dictionary. By design, the object management is designed for fast access to the most important [object views](https://datatoolspro.com/tutorials/data-tools-erd-and-object-views/ \"Data Tools Object and ERD Views\") aligned to your business.\n\n![](https://datatoolspro.com/wp-content/uploads/2024/01/image-53-1024x239.webp)\n\n## How to Access the Object Dictionary:\n\nWhen logging into DataTools Pro, by default, you will see the object dictionary.\n\n[Video: DataTools Pro Object Dictionary for Salesforce](https://www.youtube.com/embed/V_WCCDRU7W0?feature=oembed)\n\n## Adding Salesforce Objects to your Dictionary\n\n1. For DataTools Pro admin users, click on “Select Objects” button or click anywhere in the Saleseforce objects space to view a dropdown for all salesforce objects. If you do not see “Your Salesforce Objects” make sure “Show Objects is Checked”.\n\n***Note:*** The option to add more objects is not available for viewer accounts.\n\n![](https://datatoolspro.com/wp-content/uploads/2023/08/image-6-1024x153.png)\n\n2. Select the object/ Objects by checking the box next to the object name. You can search for specific objects by Label or API name.\n\n![](https://datatoolspro.com/wp-content/uploads/2023/08/image-7.png)\n\n## Adding Notes and Descriptions\n\nBy clicking on the “Edit” button you can add notes for any object that are persisted for all users. We ae looking for feedback on notes and chat as part of data object activity management. Feel free to reach out to our team and share your needs for object management.\n\n#### Notes\n\nNotes are currently formatted as a simple single entry text field. In the event you are using DataTools Pro to help with migration, development or other initiatives, this is an area to quickly capture basic notes.\n\n#### Description\n\nEnter a simple description that highlights the function for your object.\n\n#### Other Fields\n\nHave other fields that you want to organize or enhance your data dictionary? Feel free to contact our support team and we are always here to take enhancement requests!\n\n## Visualize Object Relationships\n\nIn the object manager, you can click on the diagram icon to view an interactive of the object and its direct related foreign objects.\n\n![](https://datatoolspro.com/wp-content/uploads/2024/01/image-49-png.webp)\n\n![](https://datatoolspro.com/wp-content/uploads/2024/01/image-50-1024x409.webp)\n\n#### Adding missing objects\n\nWhen a forieng object is related but not yet added to the DataTools Pro dictionary, it is displayed as a gray entity. You can click on the “+” button to add the entity to your dictionary.\n\n#### Creating an entity relationship diagram (ERD) View\n\nClicking on “Add an ERD View” allows you to save an ERD view for easy reference and further customization. This is a great starting point to construct views that are aligned to apps, or models for analytics.\n\n## Export Object Names\n\n![](https://datatoolspro.com/wp-content/uploads/2024/01/image-52-png.webp)\n\nTo quickly export a list of objects within your dictionary, you can use our available export options\n\n- Copy to clipboard\n- Export to CSV\n- Export to Excel\n\n## Categorizing and Grouping Objects in Views\n\nTo organize objects together in one or multiple views, you can click the “Edit Views” button.\n[**Learn More about Views**](https://datatoolspro.com/tutorials/data-tools-erd-and-object-views/ \"Data Tools Object and ERD Views\")\n\n![](https://datatoolspro.com/wp-content/uploads/2024/01/image-42.png)\n\n## Managing Fields\n\n![](https://datatoolspro.com/wp-content/uploads/2024/01/image-51-png.webp)\n\nTo view individual fields within each object, simply click on the object name within the object table.\n\n[**View and Manage Fields Documentation**](/salesforce-field-dictionary-with-datatools-pro/ \"View and Manage Fields Documentation\")"
}