{
  "post_id": 9556,
  "title": "Salesforce Object Access, Security and Troubleshooting in DataTools Pro",
  "slug": "salesforce-object-access-in-datatools-pro",
  "url": "https://datatoolspro.com/tutorials/salesforce-object-access-in-datatools-pro/",
  "date": "2024-05-22T15:51:15",
  "modified": "2024-05-22T15:59:07",
  "categories": [
    "DataTools Pro"
  ],
  "tags": [
    "datatoolspro",
    "Dictionary"
  ],
  "excerpt": "DataTools Pro uses the Salesforce REST API to access meta data within your organization. When you log into DataToolsPro as a user, it inherits and enforces the Salesforce security, role, and permissions settings anytime you request data from object browser dropdown. After an object is added you can naigate and view only fields that your […]",
  "content_markdown": "DataTools Pro uses the Salesforce REST API to access meta data within your organization. When you log into DataToolsPro as a user, it inherits and enforces the Salesforce security, role, and permissions settings anytime you request data from object browser dropdown. After an object is added you can naigate and view only fields that your user has access to.\n\n![](https://datatoolspro.com/wp-content/uploads/2024/05/image-15.png)\n\n## General Recommendation\n\nWe typically recommend that your Salesforce admin add objects within DataTools Pro for your organization to enusre completeness of your object meta-data inventory.\n\n#### How DataTools Pro enforces Object and Field Security\n\nThe goal of using DataTools Pro is visibility and understanding of object / field relationships and relationships to metrics / KPIs. Once the objects are added into DataTools Pro, the app enforce access at the Salesforce user level, but enforces object and field security only for adding new objects or refreshing field history for existing objects. This means additional invited user who do not have object level access inside of Salesforce can still benefit and understand the object and field relationships. DataTools Pro does not access or query record data, so by design the scope of use is limited to object and field metadata.\n\n## Troubleshooting Objects that are Missing:\n\n#### Issue: Not all objects are available and visible inside of the object browser\n\n### Profile\n\nEnsure that the user’s profile has the necessary “Read” (and other relevant) permissions for the objects they need to access. This can be checked and updated in the profile settings under “Object Settings”\n\nSetup → Users → Profiles → Select the relevant profile.\n\n**Organization-Wide Defaults (OWD)**:\n\nReview the organization-wide sharing defaults for the objects. If the default is set to private or public read-only, sharing rules or manual sharing might be required to give the user access to records they do not own.\n\n### API-Specific Considerations\n\n**API Enabled**:\n\nEnsure that the “API Enabled” permission is granted to the user. This is essential for users to interact with Salesforce through the REST API. Technically, you wouldn’t be able to view any objects and also potentially have issues logging in if API access is disabled.\n\n### Managed Packages\n\n**Package Visibility**:\n\nIf the objects are part of a managed package, ensure that the user’s profile or permission set includes permissions for those objects. Managed packages often come with their own set of permissions and licensing restrictions.\n\n**License Assignment**:\n\nCheck if the user has been assigned a license for the managed package. Users need to have a valid license for accessing objects provided by managed packages.\n\n## Field Access\n\nSimilar to object access, field level security can potentially restrict the number of fields you can view, if you load objects into DataTools Pro.\n\n## Data Access\n\nDataTools Pro does not query data records within objects that you load via the Object dropdown. DataTools Pro is a meta data management and analysis tool and not designed to view or analyze object recrords."
}