{
  "post_id": 9200,
  "title": "Create Salesforce Field Dictionary with DataTools Pro",
  "slug": "salesforce-field-dictionary-with-datatools-pro",
  "url": "https://datatoolspro.com/tutorials/salesforce-field-dictionary-with-datatools-pro/",
  "date": "2023-07-01T20:03:55",
  "modified": "2025-01-08T00:26:21",
  "categories": [
    "DataTools Pro"
  ],
  "tags": [
    "datatoolspro",
    "Dictionary"
  ],
  "excerpt": "DataTools provides a Salesforce Field Dictionary that includes a detailed list of fields.",
  "content_markdown": "[DataTools Pro](https://datatoolspro.com/salesforce-dictionary-app/ \"Free Smart Salesforce Dictionary Data Tools\") provides a free Salesforce Field Dictionary that includes a detailed list of fields. Currently DataTools Pro dictionary supports the following columns.\n\n[Video: DataTools Data Dictionary for Salesforce](https://www.youtube.com/embed/B-qT0_6clM8?feature=oembed)\n\n**Reporting** – We have built DataTools Pro with “data out” in mind. Our reporting status field can be updated in settings or by multi-select.\n\n**Field Name** – Salesforce Field Name (API Name)\n\n**Field Label** – Salesforce field Label displayed to end users in Salesforce\n\n**Data Type** – Data Type for the field that can be filtered.\n\n**Data Sensitivity Level –** Data sensitivity level introduces Salesforce data governance capabilities into DataTools Pro.\n\n**Definition** – Definition is currently a DataTools Pro managed field, allowing you to input definitions to individual fields independent of Salesforce.\n\n**Metric Relation** – Metric Relation is a lookup field that flags individual fields that are linked to metrics, ensuring you undrstand relationships between data and the business critical metrics they impact.\n\n**Pickiest Values** – For picklist data Type, all defined “Picklist Values” will be displayed in a semi-colon separated list. This list only includes enabled picklist values and not disabled or deprecated field values.\n\n**Want to see more fields?** Let us know what else you would like to access or input within your Salesforce Data Dictionary.\n\n![](https://datatoolspro.com/wp-content/uploads/2023/07/image-1024x351.webp)\n\n## Dictionary Toolbar\n\n![](https://datatoolspro.com/wp-content/uploads/2023/07/image-5-png.webp)\n\n1. **Object** **Explorer –** Navigate back to the object explorer\n2. **Object Detail –** Navigate to another Salesforce object\n3. **Salesforce Object Manager** – Navigate to your Salesforce object manager.\n4. **Field Change Tracking** – View field changes that occur on a daily basis. [Learn more about object change tracking.](https://datatoolspro.com/tutorials/schedule-salesforce-object-change-tracking/ \"Schedule Salesforce object change tracking\")\n5. **Refresh Fields** – Manually refresh DataTools Pro with the latest field updates from Salesforce\n\nBecause DataTools Pro does not display all of the meta data from each field, we provide direct access to open the standard [Salesforce Object Manager](https://help.salesforce.com/s/articleView?id=sf.custom_field_attributes.htm&type=5) by clicking on the cloud icon.\n\n## Editing Field Inputs\n\nTo edit individual record definitions, click on the edit button.\n\n![](https://datatoolspro.com/wp-content/uploads/2024/01/image-34.png)\n\nWithin the side panel, update your Reporting tag and definition. Click save to commit your changes.\n\n![Salesforce Field Definition](https://datatoolspro.com/wp-content/uploads/2024/01/image-33.png)\n\n## Editing Multiple Records with Multi-Selection\n\nTo edit multiple records click on any record and hold shift key and click on another row within the table. DataTools will select all rows between and then display the bulk edit dropdown. Currently we support only “Reporting” field for multi-editing, but we will introduce more editable fields in the future.\n\n![Salesforce Data Dictionary Status](https://datatoolspro.com/wp-content/uploads/2024/01/image-32.png)\n\n## Navigation\n\n### Search Fields\n\nDataTools Pro features 2 methods to search records within your dictionary.\n\n1. You can use the search box that is always visible. This search will operate across all fields in the data dictionary, including definition.\n2. Search toggle – The search option will search only field name, to narrow down your field list.\n\n### Filter Options\n\nFilter option allows you to filter your field dictionary by data type.\n\n![](https://datatoolspro.com/wp-content/uploads/2023/07/image-2-1024x122.webp)\n\n- **Filter by Data Type** – Filter by data type will display available fields by their data types.\n  ![Salesforce Field Types](https://datatoolspro.com/wp-content/uploads/2024/01/image-37.png)\n- **Filter by Data Sensitivity Level** – Filter data for governance review but sensitivity level.\n- **Filter by Formula Field** – Display fields that contain formulas for easy review.\n  ![](https://datatoolspro.com/wp-content/uploads/2023/07/image-3-png.webp)\n\n### Entity Explorer\n\n![](https://datatoolspro.com/wp-content/uploads/2023/07/image-7-png.webp)\n\nDataTools Pro has a simple entity diagram, that gives you a visual representation of the current object and other related objects.\n\n![](https://datatoolspro.com/wp-content/uploads/2023/07/image-8-1024x487.webp)\n\n## Formula Explorer\n\nExplore and explain Salesforce fields in detail with a single click.\n\n![](https://datatoolspro.com/wp-content/uploads/2023/07/image-4-1024x397.webp)\n\n**Explain Formula –** Uses AI service to translate your salesforce formula into a plain english description\n\n**Update Description –** Enter your field description and save for future reference.\n\n## Export your Salesforce Field Dictionary\n\nDataTools Pro currently supports basic file export options for a Salesforce field dictionary.\n\n**IMPORTANT:** Export options will only include fields visible within your metrics table. This includes filtered or searched records.\n\n![](https://datatoolspro.com/wp-content/uploads/2023/07/image-6-png.webp)\n\n- **Copy to Clipboard** – Copy the contents of the dictionary table into you system clipboard.\n- **CSV** – Export a CSV file containing the contents of the dictionary table\n- **XLS** – Export an Excel XLS file containing the contents of the dictionary table\n- **PDF** – Export a PDF file containing the contents of the dictionary table\n\n## Details on Salesforce Field Dictionary Security\n\nWhen loading or refreshing fields into DataTools Pro, we utilize the security profile and access from Salesforce. In the event your Salesforce role or profile level settings does not have access to certain fields in Salesforce, they will not appear in DataTools Pro. We recommend having an administrator role to create a comprehensive list of fields within your Salesforce org.\n\n**Writeback to Salesforce**\n\nCurrently DataTools Pro does not support writeback of description or other metadata points back to Salesforce. It is something we will continue to evaluate with users. Make sure to let us know if this is a feature you would like to see so we can bump it up in our backlog!\n\n**Viewing Data within you Objects**\n\nDataTools Pro does NOT connect or access individual records or data within your objects, so it is not possible to view data. This is not a feature we plan to support within DataTools App. [Learn more about DataTools Pro security FAQ.](https://datatoolspro.com/datatoolspro-data-security-faq/ \"DataToolsPro Data Security FAQ\")"
}