{
  "post_id": 10322,
  "title": "Schedule Salesforce object change tracking",
  "slug": "schedule-salesforce-object-change-tracking",
  "url": "https://datatoolspro.com/tutorials/schedule-salesforce-object-change-tracking/",
  "date": "2024-11-10T18:00:25",
  "modified": "2024-11-10T18:00:35",
  "categories": [
    "DataTools Pro"
  ],
  "tags": [
    "datatoolspro",
    "governance"
  ],
  "excerpt": "DataTools Pro provides Salesforce object change tracking that identifies when objects receive new fields or have fields deleted. This information is extremely important for downstream processes and integrations with your Salesforce organization. By default, changes are tracked only when a DataTools Pro user refreshes an object to look for changes. IMPORTANT NOTE: DataTools Pro does […]",
  "content_markdown": "DataTools Pro provides Salesforce object change tracking that identifies when objects receive new fields or have fields deleted. This information is extremely important for downstream processes and integrations with your Salesforce organization. By default, changes are tracked only when a DataTools Pro user refreshes an object to look for changes.\n\n**IMPORTANT NOTE:** DataTools Pro does not evaluate or query changes to your data within your Salesforce organization. Only changes to your object meta data including:\n\n1. Newly added fields\n2. Deleted fields\n\n**New change events:** We have a list of additional object changes coming soon to DataTools Pro. If you have specific meta-data changes that you would like to track, feel free to contact our team anytime via our chat widget, email, contact forms.\n\n[Video: Schedule Salesforce Object Change Tracking](https://www.youtube.com/embed/oIEd-NQ9Hy8?feature=oembed)\n\n## Salesforce object change tracking scheduler\n\n[Field History tracking](/tutorials/field-history-tracking-for-salesforce/ \"Salesforce field history tracking\") is a enabled by default for all DataTools Pro versions. Now, you can click “Add to Scheduler” to automatically refresh and look for changes on a nightly basis. This ensures you are always looking at up to date daily changes.\n\nTo view field history and quickly schedule an object for refresh:\n\n1. Select any Salesforce object from the Dictionary tab (example: Lead, Opportunity, Account, etc)\n2. Click on the history icon located in the upper right corner ![](https://datatoolspro.com/wp-content/uploads/2024/11/image-10-png.webp)\n3. Click on the button “Add to Scheduler” button. That’s it!\n\n![Salesforce object change tracking window](https://datatoolspro.com/wp-content/uploads/2024/11/image-9-1024x437.webp)\n\n## View all scheduled objects\n\nThere are two methods in DataTools Pro to access and manage the list of objects for scheduled refresh.\n\n**From the History Dialogue**\n\nClick on the button labeled “Scheduler Objects List”\n\n![View all scheduled objects](https://datatoolspro.com/wp-content/uploads/2024/11/image-12-png.webp)\n\nThis will direct you to the settings page.\n\n## Stop DataTools Pro from Scheduled Refreshes\n\nTo turn off scheduled refreshes of your object meta data you can disable from 2 locations\n\n**From the History Dialogue**\n\nClick on the “Remove from Schedule” button in the History Dialogue\n\n![Remove from DataTools Object scheduler](https://datatoolspro.com/wp-content/uploads/2024/11/image-11-png.webp)\n\n**From Scheduler Settings**\n\nClick on the “Delete” icon next to the object that you would like to remove.\n\n## Scheduler Settings\n\nWithin DataTools Pro settings, you can select “Objects Scheduler” to get access to all scheduled objects.\n\nCurrently you can add and remove objects from the Settings screen.\n\nNOTE: Only Salesforce objects within your dictionary can be scheduled for metadata refresh.\n\n![DataTools Pro schedule object change refresh](https://datatoolspro.com/wp-content/uploads/2024/11/image-13-1024x487.webp)"
}